---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamCoverOffset
source: html/a17de4d9-dfc6-4ef9-1f69-93311ec7685a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamCoverOffset Property

"Additional Cover Offset": Additional cover offset of the fabric distribution.

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamCoverOffset { get; }
```